results/IntelR_XeonR_Silver_4216_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log
/usr/bin/time -f '%e %U %S' -o /root/app-repl-numa-benchmarks/results/IntelR_XeonR_Silver_4216_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log.time ./db_bench --benchmarks=fillrandom,stats --use_existing_db=0 --disable_auto_compactions=1 --sync=0 --max_background_jobs=16 --max_write_buffer_number=8 --allow_concurrent_memtable_write=false --level0_file_num_compaction_trigger=10485760 --level0_slowdown_writes_trigger=10485760 --level0_stop_writes_trigger=10485760 --undefok=use_blob_cache,use_shared_block_and_blob_cache,blob_cache_size,blob_cache_numshardbits,prepopulate_blob_cache,multiread_batched,cache_low_pri_pool_ratio,prepopulate_block_cache --db=/tmp/rocksdb/db --wal_dir=/tmp/rocksdb/wal --num=2000000 --key_size=20 --value_size=400 --block_size=8192 --cache_size=6442450944 --cache_numshardbits=6 --compression_max_dict_bytes=0 --compression_ratio=0.5 --compression_type=none --bytes_per_sync=1048576 --benchmark_write_rate_limit=0 --write_buffer_size=134217728 --target_file_size_base=134217728 --max_bytes_for_level_base=1073741824 --verify_checksum=1 --delete_obsolete_files_period_micros=62914560 --max_bytes_for_level_multiplier=8 --statistics=0 --stats_per_interval=1 --stats_interval_seconds=60 --report_interval_seconds=1 --histogram=1 --memtablerep=skip_list --bloom_bits=10 --open_files=-1 --subcompactions=1 --compaction_style=0 --num_levels=8 --min_level_to_compress=-1 --level_compaction_dynamic_level_bytes=true --pin_l0_filter_and_index_blocks_in_cache=1 --threads=1 --memtablerep=vector --allow_concurrent_memtable_write=false --disable_wal=1 --seed=1752665657 --report_file=/root/app-repl-numa-benchmarks/results/IntelR_XeonR_Silver_4216_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log.r.csv 2>&1 | tee -a /root/app-repl-numa-benchmarks/results/IntelR_XeonR_Silver_4216_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log
RocksDB:    version 10.5.0
Date:       Wed Jul 16 13:34:17 2025
CPU:        64 * Intel(R) Xeon(R) Silver 4216 CPU @ 2.10GHz
CPUCache:   22528 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       20 bytes each (+ 0 bytes user-defined timestamp)
Values:     400 bytes each (200 bytes after compression)
Entries:    2000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    801.1 MB (estimated)
FileSize:   419.6 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: VectorRepFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/tmp/rocksdb/db]
fillrandom   :       1.074 micros/op 931202 ops/sec 2.148 seconds 2000000 operations;  373.0 MB/s
Microseconds per write:
Count: 2000000 Average: 1.0738  StdDev: 3.61
Min: 0  Median: 0.5391  Max: 4000
Percentiles: P50: 0.54 P75: 0.81 P99: 2.82 P99.9: 5.33 P99.99: 12.54
------------------------------------------------------
[       0,       1 ]  1854832  92.742%  92.742% ###################
(       1,       2 ]    60743   3.037%  95.779% #
(       2,       3 ]    78459   3.923%  99.702% #
(       3,       4 ]     1806   0.090%  99.792% 
(       4,       6 ]     3238   0.162%  99.954% 
(       6,      10 ]      659   0.033%  99.987% 
(      10,      15 ]      124   0.006%  99.993% 
(      15,      22 ]       23   0.001%  99.994% 
(      22,      34 ]       10   0.001%  99.995% 
(      34,      51 ]        9   0.000%  99.995% 
(      51,      76 ]       58   0.003%  99.998% 
(      76,     110 ]       14   0.001%  99.999% 
(     110,     170 ]        7   0.000%  99.999% 
(     170,     250 ]        2   0.000%  99.999% 
(     250,     380 ]        6   0.000% 100.000% 
(     580,     870 ]        5   0.000% 100.000% 
(     870,    1300 ]        3   0.000% 100.000% 
(    1300,    1900 ]        1   0.000% 100.000% 
(    2900,    4400 ]        1   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      4/0    464.09 MB   0.0      0.0     0.0      0.0       0.5       0.5      0.5       0.0   1.0      0.0    172.8      2.69              2.38         4    0.671   1223K      0       0.0       0.0
 Sum      4/0    464.09 MB   0.0      0.0     0.0      0.0       0.5       0.5      0.5       0.0   1.0      0.0    172.8      2.69              2.38         4    0.671   1223K      0       0.0       0.0
 Int      0/0      0.00 KB   0.0      0.0     0.0      0.0       0.5       0.5      0.5       0.0   1.0      0.0    172.8      2.69              2.38         4    0.671   1223K      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0      0.00 KB   0.0      0.0     0.0      0.0       0.5       0.5      0.5       0.0   0.0      0.0    172.8      2.69              2.38         4    0.671   1223K      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 2.2 total, 2.2 interval
Flush(GB): cumulative 0.453, interval 0.453
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.45 GB write, 215.60 MB/s write, 0.00 GB read, 0.00 MB/s read, 2.7 seconds
Interval compaction: 0.45 GB write, 215.60 MB/s write, 0.00 GB read, 0.00 MB/s read, 2.7 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x55bc76a017a0#2623 capacity: 6.00 GB seed: 1752665657 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 0 last_secs: 7.2e-05 secs_since: 2
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 2.2 total, 2.2 interval
Cumulative writes: 0 writes, 2000K keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.81 GB, 386.32 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 2000K keys, 0 commit groups, 0.0 writes per commit group, ingest: 831.60 MB, 386.32 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0